var uploadedDataURL = "/asset/get/s/data-1510290527608-Sy_vV3MkM.xls";

//geo鏁版嵁
var geoCoordMap = {
    '涓婃捣': [121.4648, 31.2891],
    '涓滆帪': [113.8953, 22.901],
    '涓滆惀': [118.7073, 37.5513],
    '涓北': [113.4229, 22.478],
    '涓存本': [111.4783, 36.1615],
    '涓存矀': [118.3118, 35.2936],
    '涓逛笢': [124.541, 40.4242],
    '涓芥按': [119.5642, 28.1854],
    '涔岄瞾鏈ㄩ綈': [87.9236, 43.5883],
    '浣涘北': [112.8955, 23.1097],
    '淇濆畾': [115.0488, 39.0948],
    '鍏板窞': [103.5901, 36.3043],
    '鍖呭ご': [110.3467, 41.4899],
    '鍖椾含': [116.4551, 40.2539],
    '鍖楁捣': [109.314, 21.6211],
    '鍗椾含': [118.8062, 31.9208],
    '鍗楀畞': [108.479, 23.1152],
    '鍗楁槍': [116.0046, 28.6633],
    '鍗楅��': [121.1023, 32.1625],
    '鍘﹂棬': [118.1689, 24.6478],
    '鍙板窞': [121.1353, 28.6688],
    '鍚堣偉': [117.29, 32.0581],
    '鍛煎拰娴╃壒': [111.4124, 40.4901],
    '鍜搁槼': [108.4131, 34.8706],
    '鍝堝皵婊�': [127.9688, 45.368],
    '鍞愬北': [118.4766, 39.6826],
    '鍢夊叴': [120.9155, 30.6354],
    '澶у悓': [113.7854, 39.8035],
    '澶ц繛': [122.2229, 39.4409],
    '澶╂触': [117.4219, 39.4189],
    '澶師': [112.3352, 37.9413],
    '濞佹捣': [121.9482, 37.1393],
    '瀹佹尝': [121.5967, 29.6466],
    '瀹濋浮': [107.1826, 34.3433],
    '瀹胯縼': [118.5535, 33.7775],
    '甯稿窞': [119.4543, 31.5582],
    '骞垮窞': [113.5107, 23.2196],
    '寤婂潑': [116.521, 39.0509],
    '寤跺畨': [109.1052, 36.4252],
    '寮犲鍙�': [115.1477, 40.8527],
    '寰愬窞': [117.5208, 34.3268],
    '寰峰窞': [116.6858, 37.2107],
    '鎯犲窞': [114.6204, 23.1647],
    '鎴愰兘': [103.9526, 30.7617],
    '鎵窞': [119.4653, 32.8162],
    '鎵垮痉': [117.5757, 41.4075],
    '鎷夎惃': [91.1865, 30.1465],
    '鏃犻敗': [120.3442, 31.5527],
    '鏃ョ収': [119.2786, 35.5023],
    '鏄嗘槑': [102.9199, 25.4663],
    '鏉窞': [119.5313, 29.8773],
    '鏋ｅ簞': [117.323, 34.8926],
    '鏌冲窞': [109.3799, 24.9774],
    '鏍床': [113.5327, 27.0319],
    '姝︽眽': [114.3896, 30.6628],
    '姹曞ご': [117.1692, 23.3405],
    '姹熼棬': [112.6318, 22.1484],
    '娌堥槼': [123.1238, 42.1216],
    '娌у窞': [116.8286, 38.2104],
    '娌虫簮': [114.917, 23.9722],
    '娉夊窞': [118.3228, 25.1147],
    '娉板畨': [117.0264, 36.0516],
    '娉板窞': [120.0586, 32.5525],
    '娴庡崡': [117.1582, 36.8701],
    '娴庡畞': [116.8286, 35.3375],
    '娴峰彛': [110.3893, 19.8516],
    '娣勫崥': [118.0371, 36.6064],
    '娣畨': [118.927, 33.4039],
    '娣卞湷': [114.5435, 22.5439],
    '娓呰繙': [112.9175, 24.3292],
    '娓╁窞': [120.498, 27.8119],
    '娓崡': [109.7864, 35.0299],
    '婀栧窞': [119.8608, 30.7782],
    '婀樻江': [112.5439, 27.7075],
    '婊ㄥ窞': [117.8174, 37.4963],
    '娼嶅潑': [119.0918, 36.524],
    '鐑熷彴': [120.7397, 37.5128],
    '鐜夋邯': [101.9312, 23.8898],
    '鐝犳捣': [113.7305, 22.1155],
    '鐩愬煄': [120.2234, 33.5577],
    '鐩橀敠': [121.9482, 41.0449],
    '鐭冲搴�': [114.4995, 38.1006],
    '绂忓窞': [119.4543, 25.9222],
    '绉︾殗宀�': [119.2126, 40.0232],
    '缁嶅叴': [120.564, 29.7565],
    '鑱婂煄': [115.9167, 36.4032],
    '鑲囧簡': [112.1265, 23.5822],
    '鑸熷北': [122.2559, 30.2234],
    '鑻忓窞': [120.6519, 31.3989],
    '鑾辫姕': [117.6526, 36.2714],
    '鑿忔辰': [115.6201, 35.2057],
    '钀ュ彛': [122.4316, 40.4297],
    '钁姦宀�': [120.1575, 40.578],
    '琛℃按': [115.8838, 37.7161],
    '琛㈠窞': [118.6853, 28.8666],
    '瑗垮畞': [101.4038, 36.8207],
    '瑗垮畨': [109.1162, 34.2004],
    '璐甸槼': [106.6992, 26.7682],
    '杩炰簯娓�': [119.1248, 34.552],
    '閭㈠彴': [114.8071, 37.2821],
    '閭兏': [114.4775, 36.535],
    '閮戝窞': [113.4668, 34.6234],
    '閯傚皵澶氭柉': [108.9734, 39.2487],
    '閲嶅簡': [107.7539, 30.1904],
    '閲戝崕': [120.0037, 29.1028],
    '閾滃窛': [109.0393, 35.1947],
    '閾跺窛': [106.3586, 38.1775],
    '闀囨睙': [119.4763, 31.9702],
    '闀挎槬': [125.8154, 44.2584],
    '闀挎矙': [113.0823, 28.2568],
    '闀挎不': [112.8625, 36.4746],
    '闃虫硥': [113.4778, 38.0951],
    '闈掑矝': [120.4651, 36.3373],
    '闊跺叧': [113.7964, 24.7028]
};
/**
 * 鍥捐〃鎺у埗鍣�
 */
var Chart = {    
    seriesData: [{
            "name": "2015骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 2637
                },
                {
                    "name": "澶╂触",
                    "value": 5358
                },
                {
                    "name": "娌冲寳",
                    "value": 4852
                },
                {
                    "name": "灞辫タ",
                    "value": 5099
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 3215
                },
                {
                    "name": "杈藉畞",
                    "value": 5150
                },
                {
                    "name": "鍚夋灄",
                    "value": 2779
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 3276
                },
                {
                    "name": "涓婃捣",
                    "value": 1070
                },
                {
                    "name": "姹熻嫃",
                    "value": 12999
                },
                {
                    "name": "娴欐睙",
                    "value": 16270
                },
                {
                    "name": "瀹夊窘",
                    "value": 13770
                },
                {
                    "name": "绂忓缓",
                    "value": 7943
                },
                {
                    "name": "姹熻タ",
                    "value": 3058
                },
                {
                    "name": "灞变笢",
                    "value": 13376
                },
                {
                    "name": "娌冲崡",
                    "value": 6171
                },
                {
                    "name": "婀栧寳",
                    "value": 4624
                },
                {
                    "name": "婀栧崡",
                    "value": 9044
                },
                {
                    "name": "骞夸笢",
                    "value": 24676
                },
                {
                    "name": "骞胯タ",
                    "value": 3978
                },
                {
                    "name": "娴峰崡",
                    "value": 2103
                },
                {
                    "name": "閲嶅簡",
                    "value": 4829
                },
                {
                    "name": "鍥涘窛",
                    "value": 8571
                },
                {
                    "name": "璐靛窞",
                    "value": 1035
                },
                {
                    "name": "浜戝崡",
                    "value": 5375
                },
                {
                    "name": "瑗胯棌",
                    "value": 334
                },
                {
                    "name": "闄曡タ",
                    "value": 5406
                },
                {
                    "name": "鐢樿們",
                    "value": 3063
                },
                {
                    "name": "闈掓捣",
                    "value": 1036
                },
                {
                    "name": "瀹佸",
                    "value": 1692
                },
                {
                    "name": "鏂扮枂",
                    "value": 4992
                }
            ]
        },
        {
            "name": "2014骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 3196
                },
                {
                    "name": "澶╂触",
                    "value": 5322
                },
                {
                    "name": "娌冲寳",
                    "value": 5009
                },
                {
                    "name": "灞辫タ",
                    "value": 5121
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 3406
                },
                {
                    "name": "杈藉畞",
                    "value": 5650
                },
                {
                    "name": "鍚夋灄",
                    "value": 2794
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 3451
                },
                {
                    "name": "涓婃捣",
                    "value": 1172
                },
                {
                    "name": "姹熻嫃",
                    "value": 13187
                },
                {
                    "name": "娴欐睙",
                    "value": 17135
                },
                {
                    "name": "瀹夊窘",
                    "value": 16077
                },
                {
                    "name": "绂忓缓",
                    "value": 8684
                },
                {
                    "name": "姹熻タ",
                    "value": 2873
                },
                {
                    "name": "灞变笢",
                    "value": 13570
                },
                {
                    "name": "娌冲崡",
                    "value": 6355
                },
                {
                    "name": "婀栧寳",
                    "value": 5271
                },
                {
                    "name": "婀栧崡",
                    "value": 8542
                },
                {
                    "name": "骞夸笢",
                    "value": 26445
                },
                {
                    "name": "骞胯タ",
                    "value": 3942
                },
                {
                    "name": "娴峰崡",
                    "value": 2058
                },
                {
                    "name": "閲嶅簡",
                    "value": 5220
                },
                {
                    "name": "鍥涘窛",
                    "value": 9193
                },
                {
                    "name": "璐靛窞",
                    "value": 1145
                },
                {
                    "name": "浜戝崡",
                    "value": 5725
                },
                {
                    "name": "瑗胯棌",
                    "value": 388
                },
                {
                    "name": "闄曡タ",
                    "value": 5055
                },
                {
                    "name": "鐢樿們",
                    "value": 3035
                },
                {
                    "name": "闈掓捣",
                    "value": 1029
                },
                {
                    "name": "瀹佸",
                    "value": 1752
                },
                {
                    "name": "鏂扮枂",
                    "value": 5010
                }
            ]
        },
        {
            "name": "2013骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 3063
                },
                {
                    "name": "澶╂触",
                    "value": 4313
                },
                {
                    "name": "娌冲寳",
                    "value": 5204
                },
                {
                    "name": "灞辫タ",
                    "value": 5303
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 3643
                },
                {
                    "name": "杈藉畞",
                    "value": 5777
                },
                {
                    "name": "鍚夋灄",
                    "value": 2458
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 3283
                },
                {
                    "name": "涓婃捣",
                    "value": 2011
                },
                {
                    "name": "姹熻嫃",
                    "value": 13395
                },
                {
                    "name": "娴欐睙",
                    "value": 18298
                },
                {
                    "name": "瀹夊窘",
                    "value": 17610
                },
                {
                    "name": "绂忓缓",
                    "value": 8521
                },
                {
                    "name": "姹熻タ",
                    "value": 2880
                },
                {
                    "name": "灞变笢",
                    "value": 12879
                },
                {
                    "name": "娌冲崡",
                    "value": 6449
                },
                {
                    "name": "婀栧寳",
                    "value": 5798
                },
                {
                    "name": "婀栧崡",
                    "value": 8699
                },
                {
                    "name": "骞夸笢",
                    "value": 25424
                },
                {
                    "name": "骞胯タ",
                    "value": 3821
                },
                {
                    "name": "娴峰崡",
                    "value": 1976
                },
                {
                    "name": "閲嶅簡",
                    "value": 5642
                },
                {
                    "name": "鍥涘窛",
                    "value": 9571
                },
                {
                    "name": "璐靛窞",
                    "value": 1241
                },
                {
                    "name": "浜戝崡",
                    "value": 3748
                },
                {
                    "name": "瑗胯棌",
                    "value": 717
                },
                {
                    "name": "闄曡タ",
                    "value": 5952
                },
                {
                    "name": "鐢樿們",
                    "value": 2915
                },
                {
                    "name": "闈掓捣",
                    "value": 1065
                },
                {
                    "name": "瀹佸",
                    "value": 1794
                },
                {
                    "name": "鏂扮枂",
                    "value": 4944
                }
            ]
        },
        {
            "name": "2012骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 3196
                },
                {
                    "name": "澶╂触",
                    "value": 3101
                },
                {
                    "name": "娌冲寳",
                    "value": 5285
                },
                {
                    "name": "灞辫タ",
                    "value": 5587
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 3957
                },
                {
                    "name": "杈藉畞",
                    "value": 5984
                },
                {
                    "name": "鍚夋灄",
                    "value": 2820
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 3285
                },
                {
                    "name": "涓婃捣",
                    "value": 2256
                },
                {
                    "name": "姹熻嫃",
                    "value": 13517
                },
                {
                    "name": "娴欐睙",
                    "value": 19270
                },
                {
                    "name": "瀹夊窘",
                    "value": 18076
                },
                {
                    "name": "绂忓缓",
                    "value": 9942
                },
                {
                    "name": "姹熻タ",
                    "value": 3103
                },
                {
                    "name": "灞变笢",
                    "value": 13275
                },
                {
                    "name": "娌冲崡",
                    "value": 6732
                },
                {
                    "name": "婀栧寳",
                    "value": 6009
                },
                {
                    "name": "婀栧崡",
                    "value": 8748
                },
                {
                    "name": "骞夸笢",
                    "value": 25720
                },
                {
                    "name": "骞胯タ",
                    "value": 3984
                },
                {
                    "name": "娴峰崡",
                    "value": 1752
                },
                {
                    "name": "閲嶅簡",
                    "value": 5791
                },
                {
                    "name": "鍥涘窛",
                    "value": 10024
                },
                {
                    "name": "璐靛窞",
                    "value": 1360
                },
                {
                    "name": "浜戝崡",
                    "value": 3941
                },
                {
                    "name": "瑗胯棌",
                    "value": 725
                },
                {
                    "name": "闄曡タ",
                    "value": 5996
                },
                {
                    "name": "鐢樿們",
                    "value": 2954
                },
                {
                    "name": "闈掓捣",
                    "value": 1096
                },
                {
                    "name": "瀹佸",
                    "value": 1767
                },
                {
                    "name": "鏂扮枂",
                    "value": 4943
                }
            ]
        },
        {
            "name": "2011骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 3934
                },
                {
                    "name": "澶╂触",
                    "value": 2600
                },
                {
                    "name": "娌冲寳",
                    "value": 5197
                },
                {
                    "name": "灞辫タ",
                    "value": 6239
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 4591
                },
                {
                    "name": "杈藉畞",
                    "value": 6446
                },
                {
                    "name": "鍚夋灄",
                    "value": 3639
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 3435
                },
                {
                    "name": "涓婃捣",
                    "value": 2085
                },
                {
                    "name": "姹熻嫃",
                    "value": 13436
                },
                {
                    "name": "娴欐睙",
                    "value": 20178
                },
                {
                    "name": "瀹夊窘",
                    "value": 14005
                },
                {
                    "name": "绂忓缓",
                    "value": 11517
                },
                {
                    "name": "姹熻タ",
                    "value": 3354
                },
                {
                    "name": "灞变笢",
                    "value": 13375
                },
                {
                    "name": "娌冲崡",
                    "value": 6877
                },
                {
                    "name": "婀栧寳",
                    "value": 6490
                },
                {
                    "name": "婀栧崡",
                    "value": 8118
                },
                {
                    "name": "骞夸笢",
                    "value": 26586
                },
                {
                    "name": "骞胯タ",
                    "value": 4290
                },
                {
                    "name": "娴峰崡",
                    "value": 1737
                },
                {
                    "name": "閲嶅簡",
                    "value": 5729
                },
                {
                    "name": "鍥涘窛",
                    "value": 11860
                },
                {
                    "name": "璐靛窞",
                    "value": 1566
                },
                {
                    "name": "浜戝崡",
                    "value": 5022
                },
                {
                    "name": "瑗胯棌",
                    "value": 943
                },
                {
                    "name": "闄曡タ",
                    "value": 6362
                },
                {
                    "name": "鐢樿們",
                    "value": 3027
                },
                {
                    "name": "闈掓捣",
                    "value": 1163
                },
                {
                    "name": "瀹佸",
                    "value": 1829
                },
                {
                    "name": "鏂扮枂",
                    "value": 5182
                }
            ]
        },
        {
            "name": "2010骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 4279
                },
                {
                    "name": "澶╂触",
                    "value": 3165
                },
                {
                    "name": "娌冲寳",
                    "value": 5959
                },
                {
                    "name": "灞辫タ",
                    "value": 6962
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 4780
                },
                {
                    "name": "杈藉畞",
                    "value": 6781
                },
                {
                    "name": "鍚夋灄",
                    "value": 4438
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 3466
                },
                {
                    "name": "涓婃捣",
                    "value": 2176
                },
                {
                    "name": "姹熻嫃",
                    "value": 13793
                },
                {
                    "name": "娴欐睙",
                    "value": 21698
                },
                {
                    "name": "瀹夊窘",
                    "value": 7901
                },
                {
                    "name": "绂忓缓",
                    "value": 12714
                },
                {
                    "name": "姹熻タ",
                    "value": 4126
                },
                {
                    "name": "灞变笢",
                    "value": 14560
                },
                {
                    "name": "娌冲崡",
                    "value": 7890
                },
                {
                    "name": "婀栧寳",
                    "value": 6543
                },
                {
                    "name": "婀栧崡",
                    "value": 8413
                },
                {
                    "name": "骞夸笢",
                    "value": 30370
                },
                {
                    "name": "骞胯タ",
                    "value": 4351
                },
                {
                    "name": "娴峰崡",
                    "value": 1488
                },
                {
                    "name": "閲嶅簡",
                    "value": 5908
                },
                {
                    "name": "鍥涘窛",
                    "value": 13072
                },
                {
                    "name": "璐靛窞",
                    "value": 1764
                },
                {
                    "name": "浜戝崡",
                    "value": 4739
                },
                {
                    "name": "瑗胯棌",
                    "value": 781
                },
                {
                    "name": "闄曡タ",
                    "value": 6004
                },
                {
                    "name": "鐢樿們",
                    "value": 3090
                },
                {
                    "name": "闈掓捣",
                    "value": 1206
                },
                {
                    "name": "瀹佸",
                    "value": 1806
                },
                {
                    "name": "鏂扮枂",
                    "value": 5298
                }
            ]
        },
        {
            "name": "2009骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 3814
                },
                {
                    "name": "澶╂触",
                    "value": 3839
                },
                {
                    "name": "娌冲寳",
                    "value": 6802
                },
                {
                    "name": "灞辫タ",
                    "value": 7697
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 4166
                },
                {
                    "name": "杈藉畞",
                    "value": 6973
                },
                {
                    "name": "鍚夋灄",
                    "value": 5277
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 3331
                },
                {
                    "name": "涓婃捣",
                    "value": 2831
                },
                {
                    "name": "姹熻嫃",
                    "value": 14542
                },
                {
                    "name": "娴欐睙",
                    "value": 23391
                },
                {
                    "name": "瀹夊窘",
                    "value": 8191
                },
                {
                    "name": "绂忓缓",
                    "value": 13633
                },
                {
                    "name": "姹熻タ",
                    "value": 4262
                },
                {
                    "name": "灞变笢",
                    "value": 16166
                },
                {
                    "name": "娌冲崡",
                    "value": 8587
                },
                {
                    "name": "婀栧寳",
                    "value": 6630
                },
                {
                    "name": "婀栧崡",
                    "value": 7444
                },
                {
                    "name": "骞夸笢",
                    "value": 32455
                },
                {
                    "name": "骞胯タ",
                    "value": 5196
                },
                {
                    "name": "娴峰崡",
                    "value": 1323
                },
                {
                    "name": "閲嶅簡",
                    "value": 5992
                },
                {
                    "name": "鍥涘窛",
                    "value": 21680
                },
                {
                    "name": "璐靛窞",
                    "value": 1816
                },
                {
                    "name": "浜戝崡",
                    "value": 5075
                },
                {
                    "name": "瑗胯棌",
                    "value": 678
                },
                {
                    "name": "闄曡タ",
                    "value": 5501
                },
                {
                    "name": "鐢樿們",
                    "value": 2937
                },
                {
                    "name": "闈掓捣",
                    "value": 1146
                },
                {
                    "name": "瀹佸",
                    "value": 1856
                },
                {
                    "name": "鏂扮枂",
                    "value": 5120
                }
            ]
        },
        {
            "name": "2008骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 3943
                },
                {
                    "name": "澶╂触",
                    "value": 4048
                },
                {
                    "name": "娌冲寳",
                    "value": 7621
                },
                {
                    "name": "灞辫タ",
                    "value": 7867
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 5056
                },
                {
                    "name": "杈藉畞",
                    "value": 7214
                },
                {
                    "name": "鍚夋灄",
                    "value": 5782
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 4528
                },
                {
                    "name": "涓婃捣",
                    "value": 2745
                },
                {
                    "name": "姹熻嫃",
                    "value": 15431
                },
                {
                    "name": "娴欐睙",
                    "value": 25911
                },
                {
                    "name": "瀹夊窘",
                    "value": 8412
                },
                {
                    "name": "绂忓缓",
                    "value": 15657
                },
                {
                    "name": "姹熻タ",
                    "value": 5914
                },
                {
                    "name": "灞变笢",
                    "value": 19594
                },
                {
                    "name": "娌冲崡",
                    "value": 11529
                },
                {
                    "name": "婀栧寳",
                    "value": 7686
                },
                {
                    "name": "婀栧崡",
                    "value": 7622
                },
                {
                    "name": "骞夸笢",
                    "value": 39389
                },
                {
                    "name": "骞胯タ",
                    "value": 6106
                },
                {
                    "name": "娴峰崡",
                    "value": 1449
                },
                {
                    "name": "閲嶅簡",
                    "value": 7262
                },
                {
                    "name": "鍥涘窛",
                    "value": 17037
                },
                {
                    "name": "璐靛窞",
                    "value": 2219
                },
                {
                    "name": "浜戝崡",
                    "value": 5037
                },
                {
                    "name": "瑗胯棌",
                    "value": 600
                },
                {
                    "name": "闄曡タ",
                    "value": 7205
                },
                {
                    "name": "鐢樿們",
                    "value": 3364
                },
                {
                    "name": "闈掓捣",
                    "value": 1120
                },
                {
                    "name": "瀹佸",
                    "value": 2172
                },
                {
                    "name": "鏂扮枂",
                    "value": 5684
                }
            ]
        },
        {
            "name": "2007骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 5335
                },
                {
                    "name": "澶╂触",
                    "value": 4482
                },
                {
                    "name": "娌冲寳",
                    "value": 8503
                },
                {
                    "name": "灞辫タ",
                    "value": 9078
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 6305
                },
                {
                    "name": "杈藉畞",
                    "value": 8005
                },
                {
                    "name": "鍚夋灄",
                    "value": 6956
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 6715
                },
                {
                    "name": "涓婃捣",
                    "value": 3952
                },
                {
                    "name": "姹熻嫃",
                    "value": 18150
                },
                {
                    "name": "娴欐睙",
                    "value": 30664
                },
                {
                    "name": "瀹夊窘",
                    "value": 13273
                },
                {
                    "name": "绂忓缓",
                    "value": 20040
                },
                {
                    "name": "姹熻タ",
                    "value": 7535
                },
                {
                    "name": "灞变笢",
                    "value": 25867
                },
                {
                    "name": "娌冲崡",
                    "value": 16314
                },
                {
                    "name": "婀栧寳",
                    "value": 8986
                },
                {
                    "name": "婀栧崡",
                    "value": 9899
                },
                {
                    "name": "骞夸笢",
                    "value": 46558
                },
                {
                    "name": "骞胯タ",
                    "value": 7652
                },
                {
                    "name": "娴峰崡",
                    "value": 1534
                },
                {
                    "name": "閲嶅簡",
                    "value": 8236
                },
                {
                    "name": "鍥涘窛",
                    "value": 21598
                },
                {
                    "name": "璐靛窞",
                    "value": 2292
                },
                {
                    "name": "浜戝崡",
                    "value": 5425
                },
                {
                    "name": "瑗胯棌",
                    "value": 638
                },
                {
                    "name": "闄曡タ",
                    "value": 9063
                },
                {
                    "name": "鐢樿們",
                    "value": 3808
                },
                {
                    "name": "闈掓捣",
                    "value": 1041
                },
                {
                    "name": "瀹佸",
                    "value": 2570
                },
                {
                    "name": "鏂扮枂",
                    "value": 6735
                }
            ]
        },
        {
            "name": "2006骞�",
            "type": "map",
            "mapType": "china",
            "label": {
                "normal": {
                    "show": true
                },
                "emphasis": {
                    "show": true
                }
            },
            "data": [{
                    "name": "鍖椾含",
                    "value": 5808
                },
                {
                    "name": "澶╂触",
                    "value": 4913
                },
                {
                    "name": "娌冲寳",
                    "value": 8631
                },
                {
                    "name": "灞辫タ",
                    "value": 10981
                },
                {
                    "name": "鍐呰挋鍙�",
                    "value": 6481
                },
                {
                    "name": "杈藉畞",
                    "value": 8671
                },
                {
                    "name": "鍚夋灄",
                    "value": 7415
                },
                {
                    "name": "榛戦緳姹�",
                    "value": 6732
                },
                {
                    "name": "涓婃捣",
                    "value": 6585
                },
                {
                    "name": "姹熻嫃",
                    "value": 23852
                },
                {
                    "name": "娴欐睙",
                    "value": 36768
                },
                {
                    "name": "瀹夊窘",
                    "value": 14151
                },
                {
                    "name": "绂忓缓",
                    "value": 21924
                },
                {
                    "name": "姹熻タ",
                    "value": 8867
                },
                {
                    "name": "灞变笢",
                    "value": 30056
                },
                {
                    "name": "娌冲崡",
                    "value": 18402
                },
                {
                    "name": "婀栧寳",
                    "value": 9590
                },
                {
                    "name": "婀栧崡",
                    "value": 12202
                },
                {
                    "name": "骞夸笢",
                    "value": 56217
                },
                {
                    "name": "骞胯タ",
                    "value": 8895
                },
                {
                    "name": "娴峰崡",
                    "value": 1398
                },
                {
                    "name": "閲嶅簡",
                    "value": 9001
                },
                {
                    "name": "鍥涘窛",
                    "value": 24338
                },
                {
                    "name": "璐靛窞",
                    "value": 2734
                },
                {
                    "name": "浜戝崡",
                    "value": 6692
                },
                {
                    "name": "瑗胯棌",
                    "value": 751
                },
                {
                    "name": "闄曡タ",
                    "value": 10546
                },
                {
                    "name": "鐢樿們",
                    "value": 4828
                },
                {
                    "name": "闈掓捣",
                    "value": 939
                },
                {
                    "name": "瀹佸",
                    "value": 2985
                },
                {
                    "name": "鏂扮枂",
                    "value": 7428
                }
            ]
        }
    ],
    /**
     * 鍒涘缓鏁版嵁杩佺Щ鍦板浘
     */
    createMapChart: function() {
        var myChart = echarts.init(document.getElementById("mapChart"));
        var _legendData = [];
        $(this.seriesData).each(function(){
            _legendData.push(this.name);
        });
        var option = {
            title: {
                text: '鍏ㄥ浗杩戝勾鏉ヤ氦閫氫簨鏁呭垎甯冪粺璁�',
                subtext: '鎴嚦2015骞村簳',
                left: 'center'
            },
            tooltip: {
                trigger: 'item'
            },
            legend: {
                orient: 'vertical',
                left: 'left',
                top:'top',
                show: true,
                selectedMode:"single",
                data: _legendData
            },
            visualMap: {
                min: 0,
                max: 23915,
                left: 'left',
                top: 'bottom',
                text: ['楂�', '浣�'], // 鏂囨湰锛岄粯璁や负鏁板�兼枃鏈�
                calculable: true
            },
            toolbox: {
                show: true,
                orient: 'vertical',
                left: 'right',
                top: 'top',
                feature: {
                    dataView: { readOnly: false },
                    restore: {},
                    saveAsImage: {}
                }
            },
            series: this.seriesData
        };

        myChart.setOption(option);
    }
};

